Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимостьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимостьПоУмолчаниюПереопределена</Name>
					<Comment>Когда Истина то вместо флажка ВидимостьПоУмолчанию используется значение аналогичного флажка предопределенного варианта отчета.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерактивнаяПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевыеСлова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованияПараметровИОтборов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользовательский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределенныйВариант</Name>
					<Comment>Вариант конфигурации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредопределенныеВариантыОтчетовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ПредопределенныеВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКлючОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Размещение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсистема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Важный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СмТакже</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПредопределенная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьНазвание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПодсистема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьИсключенияБыстрогоДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьПользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ОтчетыИзбранное/Ext/Form/Module.bsl
//#12463 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПерсональныеНастройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПанелиОтчетИзбранное", "КоличествоКолонок");
	Если ПерсональныеНастройки <> Неопределено Тогда
		КоличествоКолонок = ПерсональныеНастройки;
	Иначе
		КоличествоКолонок = 2;
	КонецЕсли;
	
	ЗаполнитьТаблицуОтчетов();	
	ОбновитьПредставленияОтчетов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаПанели(Команда)
	
	ПараметрыВыбора = Новый Структура;
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаПанелиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВариантыОтчетов.Форма.ФормаНастройкиПанелиИзбранное", ПараметрыВыбора, ЭтаФорма, УникальныйИдентификатор, , , ОписаниеОповещения);	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПанелиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоКолонок = Результат;
	
	ЗаполнитьТаблицуОтчетов();	
	ОбновитьПредставленияОтчетов(Истина, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеОбработчикиЭлементовФормы

&НаКлиенте
Процедура Подключаемый_ОтчетНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УИД = СтрЗаменить(Элемент.Имя, "Поле_", "");
	ДанныеОтчета = ДанныеОтчетаПоИдентификатору(УИД);
	Если НЕ ЗначениеЗаполнено(ДанныеОтчета.Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеОтчета.Вариант) = Тип("СправочникСсылка.ВариантыОтчетов") Тогда
		ОткрытьОтчет(ДанныеОтчета.Вариант);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ЗаполнитьТаблицуОтчетов()
	
	ТаблицаОтчетов.Очистить();	
	ТаблицаОтчетов.Загрузить(ОтчетыПотолки.ТаблицаОтчетовПользователяНаНачальнойСтранице());	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставленияОтчетов(УдалитьЭлементы = Ложь, УдалятьСвязанныеРеквизиты = Ложь, ДобавлятьРеквизитыФормы = Истина)
	
	Если УдалитьЭлементы Тогда
		УдаляемыеРеквизиты = УдалитьЭлементыПредставленияОтчетов();		
		
		// удаляем реквизиты с формы
		Если УдалятьСвязанныеРеквизиты Тогда
			ИзменитьРеквизиты(, УдаляемыеРеквизиты);
		КонецЕсли;
	КонецЕсли;
		
	Если ДобавлятьРеквизитыФормы Тогда
		// для каждого отчета создаем реквизит формы типа Строка, который будет выведен на форму как "Поле картинки"	
		ДобавляемыеРеквизиты = Новый Массив;
		Для каждого СтрокаТЗ Из ТаблицаОтчетов Цикл
			
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Поле_" + СтрокаТЗ.УИД, 
				Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(0))));
			
		КонецЦикла;	

		Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		КонецЕсли;
	КонецЕсли;
	
	КоличествоКнопок = ТаблицаОтчетов.Количество();
	СчКолонок = 1;
	Для Индекс = 1 По КоличествоКнопок Цикл
		СтрокаТЗ = ТаблицаОтчетов[Индекс-1];
		
		ИмяГруппы = "Группа" + Строка(СчКолонок);
		
		ВывестиПредставлениеОтчетаНаФорму(СтрокаТЗ, Элементы[ИмяГруппы]);
		
		СчКолонок = СчКолонок + 1;
		СчКолонок = ?(СчКолонок > КоличествоКолонок, 1, СчКолонок);
	КонецЦикла;
	
	КоличествоЗаглушек = КоличествоКолонок - (СчКолонок-1);
	Для Индекс = 1 По КоличествоЗаглушек Цикл

		ИмяГруппы = "Группа" + Строка(СчКолонок);
		
		ДекорацияЗаглушка = Элементы.Добавить("Заглушка_Декорация" + Строка(Индекс), Тип("ДекорацияФормы"), Элементы[ИмяГруппы]);
		ДекорацияЗаглушка.Вид = ВидДекорацииФормы.Картинка;
		ДекорацияЗаглушка.РастягиватьПоГоризонтали = Истина;
		ДекорацияЗаглушка.Ширина = ШиринаПредставленияОтчета();
		
		СчКолонок = СчКолонок + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВывестиПредставлениеОтчетаНаФорму(СтрокаТЗ, ГруппаОтчета)
	
	ПредставлениеОтчета = Элементы.Добавить("Поле_" + СтрокаТЗ.УИД, Тип("ПолеФормы"), ГруппаОтчета);
	ПредставлениеОтчета.Вид = ВидПоляФормы.ПолеКартинки;
	ПредставлениеОтчета.ПутьКДанным = "Поле_" + СтрокаТЗ.УИД;
	ПредставлениеОтчета.Заголовок = "";
	ПредставлениеОтчета.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	//ПредставлениеОтчета.РазмерКартинки = РазмерКартинки.Пропорционально;
	//ПредставлениеОтчета.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная, 1);
	//ПредставлениеОтчета.ЦветРамки = ЦветаСтиля.ЦветТекстаНевыбраннойКартинки;
		
	ТекстНевыбраннойКартинки = СтрШаблон("%1%2(%3)", 
											СтрЗаменить(Строка(СтрокаТЗ.Отчет), "(Отчет)", ""),
											Символы.ПС, // перенос работает только при масштабировании
											СтрокаТЗ.Наименование);	
	ПредставлениеОтчета.ТекстНевыбраннойКартинки = ТекстНевыбраннойКартинки;
	
	ПредставлениеОтчета.Ширина = ШиринаПредставленияОтчета();
	ПредставлениеОтчета.Высота = 7;
	//ПредставлениеОтчета.Высота = Окр(25 / КоличествоОтчетовВСтроке() * ?(ШиринаЭкрана = 0, 1, (ШиринаЭкрана - 160) / 1209));
	ПредставлениеОтчета.РастягиватьПоВертикали = Ложь;
	ПредставлениеОтчета.Шрифт = Новый Шрифт(ПредставлениеОтчета.Шрифт, , 12, Истина);
	ПредставлениеОтчета.ЦветТекста = Новый Цвет(100, 176, 16);//WebЦвета.ЦветМорскойВолныНейтральный;
	ПредставлениеОтчета.Гиперссылка = Истина;
	ПредставлениеОтчета.УстановитьДействие("Нажатие", "Подключаемый_ОтчетНажатие");
	ПредставлениеОтчета.Подсказка = СтрокаТЗ.Описание;
			
	Возврат ПредставлениеОтчета;
	
КонецФункции

&НаСервере
Функция ШиринаПредставленияОтчета()
	
	Возврат 20;
	
КонецФункции

&НаСервере
Функция УдалитьЭлементыПредставленияОтчетов()
	
	ЭлементыКУдалению  = Новый Массив;
	СвязанныеРеквизиты = Новый Массив;
	
	Для каждого Элемент из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") И НЕ СтрНайти(Элемент.Имя, "Поле_") = 0 Тогда
			
			Для каждого Кнопка Из Элемент.КонтекстноеМеню.ПодчиненныеЭлементы Цикл
				ЭлементыКУдалению.Добавить(Кнопка);
				Команды.Удалить(Команды[Кнопка.ИмяКоманды]);
			КонецЦикла;
			
			ЭлементыКУдалению.Добавить(Элемент);
			СвязанныеРеквизиты.Добавить(Элемент.ПутьКДанным);
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("ДекорацияФормы") 
			И НЕ СтрНайти(Элемент.Имя, "Заглушка_Декорация") = 0 
			И СтрНайти(Элемент.Имя, "РасширеннаяПодсказка") = 0
			Тогда
			ЭлементыКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Элемент Из ЭлементыКУдалению Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
	Возврат СвязанныеРеквизиты;
			
КонецФункции

&НаКлиенте
Функция ДанныеОтчетаПоИдентификатору(УИД)
	
	Результат = Новый Структура("Вариант, КлючВарианта, Отчет, Наименование");
	
	НайденныеСтроки = ТаблицаОтчетов.НайтиСтроки(Новый Структура("УИД", УИД));
	Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, НайденныеСтроки[0]);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьОтчет(Вариант)
	
	ПараметрыОткрытия = Новый Структура;	
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтаФорма, Вариант, ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти
